In [115]:
import pandas as pd

In [116]:
file = "/home/sloya7/miniconda3/election_economics_capstone-1/Data/mineral_data/gold_price.csv"
gold_df = pd.read_csv(file)

In [117]:
gold_df.shape

(13461, 2)

In [118]:
gold_df.isna().sum()

date       0
price    141
dtype: int64

In [119]:
gold_df = gold_df.dropna()
gold_df.shape

(13320, 2)

In [120]:
gold_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13320 entries, 63 to 13460
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    13320 non-null  object
 1   price   13320 non-null  float64
dtypes: float64(1), object(1)
memory usage: 312.2+ KB

In [121]:
gold_df.date = pd.to_datetime(gold_df.date)

In [122]:
gold_df.date.dt.year

63       1968
64       1968
65       1968
66       1968
67       1968
         ...
13456    2021
13457    2021
13458    2021
13459    2021
13460    2021
Name: date, Length: 13320, dtype: int32

In [123]:
gold_df['Year'] = gold_df.date.dt.year

In [124]:
gold_df

            date    price  Year
63    1968-04-01    37.70  1968
64    1968-04-02    37.30  1968
65    1968-04-03    37.60  1968
66    1968-04-04    36.95  1968
67    1968-04-05    37.00  1968
...          ...      ...   ...
13456 2021-03-30  1683.95  2021
13457 2021-03-31  1691.05  2021
13458 2021-04-01  1726.05  2021
13459 2021-04-06  1744.65  2021
13460 2021-04-07  1738.05  2021

[13320 rows x 3 columns]

In [125]:
yearly_gold = gold_df.groupby(gold_df.Year)

In [126]:
# Find the first and last day of the year for each year
earliest_dates = yearly_gold.min()
last_dates = yearly_gold.max()
test = earliest_dates, last_dates

In [127]:
start_end_dates = gold_df.query("date in @earliest_dates.date or date in @last_dates.date")

In [129]:
start_end_dates

            date     price  Year
63    1968-04-01    37.700  1968
253   1968-12-31    41.900  1968
254   1969-01-02    41.800  1969
507   1969-12-31    35.200  1969
508   1970-01-02    35.075  1970
...          ...       ...   ...
13142 2019-12-30  1514.750  2019
13143 2020-01-02  1527.100  2020
13394 2020-12-30  1887.600  2020
13395 2021-01-04  1943.200  2021
13460 2021-04-07  1738.050  2021

[108 rows x 3 columns]

In [112]:
output_df = pd.DataFrame(columns = [ 'Year','ETF_name','Year_Open', 'Year_Close', 'Year_Change', 'Loss', 'Gain'])

#loop to generate new row in output database
for i in start_end_dates.Year.unique():

    #groups date data by year
    year_df = start_end_dates[start_end_dates.Year == i]

    #uses objects to reference needed values
    open = yearly_gold.iloc[0].Open
    close = yearly_gold.iloc[1].Close
    change = close - open
    
    # creates mapping array 
    new_row = {'Year':i, 'ETF_name':year_df.iloc[0].ETF_name, 'Year_Open':open, 'Year_Close':close, 'Year_Change':change}
    
    # inserts data into new row of the output dataframe
    output_df.loc[len(output_df)] = new_row

output_df['Loss'] = 'no'
output_df['Gain'] = 'no'

/tmp/ipykernel_482391/3257861386.py:1: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  complete_df.loc['Year'] = start_end_dates.date.dt.year
/tmp/ipykernel_482391/3257861386.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  complete_df.loc['Year'] = start_end_dates.date.dt.year

In [113]:
complete_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 109 entries, 63 to Year
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   date                   108 non-null    datetime64[ns]
 1   price                  108 non-null    float64
 2   Year                   108 non-null    float64
 3   (Open, Close, change)  108 non-null    object
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 4.3+ KB